[
 {
  "title": "Bolt Modding a IBM Model M122 “Battle Cruiser”",
  "link": "https://medium.com/@davidhsmith4/bolt-modding-a-ibm-model-m122-battle-cruiser-d8b026e456b7?source=rss-d4d6e1e0a7de------2",
  "date": "Thu, 09 Apr 2020 04:26:43 GMT",
  "keywords": [
   "keyboard"
  ],
  "body": "The IBM Model M. The greatest keyboard in the history of computing. This version, the M122, is the larger cousin of the iconic M with 122 keys of buckling spring goodness. I bought the keyboard pictured above a few years back with the intention of using the 22 function keys as a macro garden for my VIM and i3 workflow but never got around to it. Now, with an upcoming move for grad school and the prospect of rebuilding my workstation, I thought I’d give the M122 a much needed refurbishing in anticipation of its future use."
 },
 {
  "title": "Installing Arch Linux — A Beginners Guide (Part 2)",
  "link": "https://medium.com/@davidhsmith4/installing-arch-linux-a-beginners-guide-part-2-e1300ff2c73b?source=rss-d4d6e1e0a7de------2",
  "date": "Tue, 07 Apr 2020 01:00:54 GMT",
  "keywords": [
   "guides-and-tutorials",
   "arch-linux"
  ],
  "body": "Now, given that you have successfully completed all the steps in part one of this guide, you should be ready to begin the installation of a window manager and some basic applications. This portion of the guide will cover:"
 },
 {
  "title": "Installing Arch Linux — A Beginners Guide (Part 1)",
  "link": "https://medium.com/@davidhsmith4/installing-arch-linux-a-beginners-guide-part-1-b1c2f399d5ee?source=rss-d4d6e1e0a7de------2",
  "date": "Fri, 27 Mar 2020 03:12:30 GMT",
  "keywords": [
   "guides-and-tutorials",
   "arch-linux"
  ],
  "body": "When I first began venturing away from Ubuntu I was struck by the steepness of the learning curve present when attempting to install Arch for the first time. This was only worsened by the lack of “beginner-friendly” material available. Most guides provided a purely procedural installation without explaining any of the intricacies of the actions being undertaken. Though this is effective in getting users from point A to point B, it does little to help them when things inevitably go off course. Though the Arch Linux wiki is a prolific source of wisdom, it is also potentially overwhelming to a user who barely knows where to begin in the first place. Furthermore, the archlinux.org’s installation guide is adequate but lacks visual guides and omits many details necessary for a user to understand the whys and wherefores of their actions. This guide seeks to fill this gap by providing beginners to the distro with a visual installation guide that follows the same structure as the installation guide present on archlinux.org. This is done with the intention of being supplementary to the official wiki such that, in the event a user becomes stuck, they may smoothly transition between the two guides while attempting to solve their issue."
 }
]